package com.javarush.task.task08.task0821;

import java.util.HashMap;
import java.util.Map;

/* 
Однофамильцы и тёзки
1. Создать словарь Map (<String, String>) и добавить туда 10 человек в виде "Фамилия"-"Имя".
2. Пусть среди этих 10 человек есть люди с одинаковыми именами.
3. Пусть среди этих 10 человек есть люди с одинаковыми фамилиями.
4. Вывести содержимое Map на экран.
*/

public class Solution {
    public static void main(String[] args) {
        Map<String, String> map = createPeopleList();
        printPeopleList(map);
    }

    public static Map<String, String> createPeopleList() {
        //напишите тут ваш код
        HashMap<String,String> hashMap =new HashMap<>();
        hashMap.put("A", "aa");
        hashMap.put("B", "bb");
        hashMap.put("A", "vv");
        hashMap.put("D", "dd");
        hashMap.put("E", "ee");
        hashMap.put("F", "vv");
        hashMap.put("G", "gg");
        hashMap.put("H", "hh");
        hashMap.put("I", "vv");
        hashMap.put("J", "jj");

        return hashMap;
    }

    public static void printPeopleList(Map<String, String> map) {
        for (Map.Entry<String, String> s : map.entrySet()) {
            System.out.println(s.getKey() + " " + s.getValue());
        }
    }
}
